saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/AnalogDevices.ADuCM4x50_DFP.3.2.0.pdsc
    <condition id="ADuCM4x50">
      <description>ADuCM4x50 device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM4050"/>
    </condition>
    <condition id="ADuCM4050">
      <description>ADuCM4050 device</description>
      <require Dvendor="Analog Devices:1"/>
      <accept Dname="ADuCM4050"/>
    </condition>
    <condition id="ADuCM4x50 CompilerIO">
      <description>ADuCM4x50 Compiler I/O requirements</description>
      <require condition="ADuCM4x50"/>
      <require condition="ARMCC"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="UART"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="STDOUT" Cvariant="User"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="STDERR" Cvariant="User"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="STDIN"  Cvariant="User"/>
      <require Cclass="Compiler" Cgroup="I/O" Csub="TTY"    Cvariant="User"/>
    </condition>
    <condition id="ADuCM4x50 Examples Support">
      <description>ADuCM4x50 Examples Support requirements</description>
      <require condition="ADuCM4x50"/>
      <require Cclass="Device" Cgroup="Examples Support" />
      <require Cclass="Device" Cgroup="Drivers" Csub="WDT"/>
    </condition>
    <condition id="ADuCM4x50 Driver">
      <description>Common ADuCM4x50 driver requirements</description>
      <require condition="ADuCM4x50"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Global Configuration"/>
      <require Cclass="Device" Cgroup="Silicon Revision"/>
    </condition>
    <condition id="ADuCM4x50 Cycle Count">
      <description>ADuCM4x50 Cycle Count requirements</description>
      <require condition="ADuCM4x50"/>
      <require condition="ADuCM4x50 Examples Support"/>
    </condition>
    <condition id="ADuCM4x50 ADC">
      <description>ADuCM4x50 ADC driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 BEEP">
      <description>ADuCM4x50 BEEP driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 Crypto">
      <description>ADuCM4x50 Crypto driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 Flash">
      <description>ADuCM4x50 Flash driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 I2C">
      <description>ADuCM4x50 I2C driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 SPI">
      <description>ADuCM4x50 SPI driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 SPORT">
      <description>ADuCM4x50 SPORT driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50 UART">
      <description>ADuCM4x50 UART driver requirements</description>
      <require condition="ADuCM4x50 Driver"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="DMA"/>
      <require Cclass="Device" Cgroup="Drivers" Csub="Power"/>
    </condition>
    <condition id="ADuCM4x50_ARM">
      <description>ADuCM4x50 ARM (Keil) </description>
      <require condition="ADuCM4x50"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="ADuCM4050_ARM">
      <description>ADuCM4050 ARM (Keil) </description>
      <require condition="ADuCM4050"/>
      <require condition="ARMCC"/>
    </condition>
    <condition id="ADuCM4050_GCC">
      <description>ADuCM4050 GCC</description>
      <require condition="ADuCM4050"/>
      <require condition="GCC"/>
    </condition>
    <condition id="ADuCM4050_IAR">
      <description>ADuCM4050 IAR</description>
      <require condition="ADuCM4050"/>
      <require condition="IAR"/>
    </condition>

  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="Drivers" doc="Documents/html/index.html">Analog Devices driver components for ADuCM4x50 devices</description>
  </taxonomy>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="3.2.0" condition="ADuCM4x50 Driver">
      <description>System Startup for ADuCM4x50</description>
      <files>
        <!-- additional include path -->
        <file category="include" name="Include/"/>

        <!-- startup files -->
        <file category="source" name="Source/ARM/startup_ADuCM4050.s" version="3.2.0" attr="config" condition="ADuCM4050_ARM"/>
        <file category="source" name="Source/GCC/startup_ADuCM4050.c" version="3.2.0" attr="config" condition="ADuCM4050_GCC"/>
        <file category="source" name="Source/GCC/reset_ADuCM4050.S" version="3.2.0" attr="config" condition="ADuCM4050_GCC"/>
        <file category="source" name="Source/IAR/startup_ADuCM4050.s" version="3.2.0" attr="config" condition="ADuCM4050_IAR"/>

        <!-- system files -->
        <file category="header" name="Include/system_ADuCM4050.h" version="3.2.0" attr="config" condition="ADuCM4050"/>
        <file category="source" name="Source/system_ADuCM4050.c" version="3.2.0" attr="config" condition="ADuCM4050"/>
        <!-- linker scripts -->
        <file category="linkerScript" name="Source/GCC/ADuCM4050.ld" version="3.2.0" attr="config" condition="ADuCM4050_GCC"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Retarget_UART" Cversion="3.2.0" condition="ADuCM4x50 CompilerIO">
      <description>Compiler::IO support for ADuCM4x50 devices</description>
      <files>
        <file category="source" name="Source/retarget_uart.c" />
        <file category="header" name="Include/retarget_uart_config.h" version="3.2.0" attr="config" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="Examples Support" Cversion="3.2.0" condition="ADuCM4x50 Examples Support">
      <description>Common utility functions for ADuCM4x50 examples</description>
      <files>
        <file category="source" name="Source/common.c"/>
        <file category="header" name="Include/common.h"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Silicon Revision" Cvariant="0.0" Cversion="3.2.0" condition="ADuCM4x50">
      <description>Silicon Revision 0.0</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
#define ADUCM4050_SI_REV  0             /* ADuCM4050 Si. Rev. 0.0 */
      </RTE_Components_h>
      <files>
        <file category="header" name="Include/adi_si_rev.h" version="3.2.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Silicon Revision" Cvariant="0.1" Cversion="3.2.0" condition="ADuCM4x50">
      <description>Silicon Revision 0.1</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
#define ADUCM4050_SI_REV  1             /* ADuCM4050 Si. Rev. 0.1 */
      </RTE_Components_h>
      <files>
        <file category="header" name="Include/adi_si_rev.h" version="3.2.0"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Global Configuration" Cversion="3.2.0" condition="ADuCM4x50">
      <description>Global configuration files for ADuCM4x50 drivers</description>
      <files>
        <file category="header" name="Include/config/adi_cycle_counting_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Cycle Count" Cversion="3.2.0" condition="ADuCM4x50 Cycle Count">
      <description>Common utility functions for ADuCM4x50 examples</description>
      <files>
        <file category="source" name="Source/adi_cyclecount.c"/>
        <file category="header" name="Include/adi_cyclecount.h"/>
        <file category="header" name="Include/config/adi_cycle_counting_config.h" version="3.2.0" attr="config"/>
      </files>
    </component>

    <!-- Drivers -->
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="3.2.0" condition="ADuCM4x50 ADC">
      <description>ADC</description>
      <files>
        <file category="source" name="Source/drivers/adc/adi_adc.c"/>
        <file category="header" name="Include/drivers/adc/adi_adc.h"/>
        <file category="header" name="Include/config/adi_adc_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___a_d_c___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="BEEP" Cversion="3.2.0" condition="ADuCM4x50 BEEP">
      <description>BEEP</description>
      <files>
        <file category="source" name="Source/drivers/beep/adi_beep.c"/>
        <file category="header" name="Include/drivers/beep/adi_beep.h"/>
        <file category="header" name="Include/config/adi_beep_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___b_e_e_p___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="3.2.0" condition="ADuCM4x50 Driver">
      <description>CRC</description>
      <files>
        <file category="source" name="Source/drivers/crc/adi_crc.c"/>
        <file category="header" name="Include/drivers/crc/adi_crc.h"/>
        <file category="header" name="Include/config/adi_crc_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___c_r_c___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="Crypto" Cversion="3.2.0" condition="ADuCM4x50 Crypto">
      <description>Crypto</description>
      <files>
        <file category="source" name="Source/drivers/crypto/adi_crypto.c"/>
        <file category="header" name="Include/drivers/crypto/adi_crypto.h"/>
        <file category="header" name="Include/config/adi_crypto_config.h" version="3.2.0" attr="config"/>
        <file category="header" name="Include/config/adi_global_config.h" version="3.2.0" attr="config"/>
        <file category="doc" name="Documents/html/group___crypto___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="DMA" Cversion="3.2.0" condition="ADuCM4x50 Driver">
      <description>DMA</description>
      <files>
        <file category="source" name="Source/drivers/dma/adi_dma.c"/>
        <file category="header" name="Include/drivers/dma/adi_dma.h"/>
        <file category="doc" name="Documents/html/group___d_m_a___driver.html"/>
      </files>
    </component>

